### Load Pandas

In [367]:
import numpy as np
import pandas as pd

### Pandas Basic

In [368]:
df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9],[10,11,12]],columns=['A','B','C'],index=['w','x','y','z'])

In [369]:
df

    A   B   C
w   1   2   3
x   4   5   6
y   7   8   9
z  10  11  12

In [370]:
df.head(2)

   A  B  C
w  1  2  3
x  4  5  6

In [371]:
df.tail(3)

    A   B   C
x   4   5   6
y   7   8   9
z  10  11  12

In [372]:
df.columns

Index(['A', 'B', 'C'], dtype='object')

In [373]:
df.index.to_list()

['w', 'x', 'y', 'z']

In [374]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, w to z
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       4 non-null      int64
 1   B       4 non-null      int64
 2   C       4 non-null      int64
dtypes: int64(3)
memory usage: 128.0+ bytes

In [375]:
df.describe()

               A          B          C
count   4.000000   4.000000   4.000000
mean    5.500000   6.500000   7.500000
std     3.872983   3.872983   3.872983
min     1.000000   2.000000   3.000000
25%     3.250000   4.250000   5.250000
50%     5.500000   6.500000   7.500000
75%     7.750000   8.750000   9.750000
max    10.000000  11.000000  12.000000

In [376]:
df.shape

(4, 3)

In [377]:
df.size

12

In [378]:
df.nunique()

A    4
B    4
C    4
dtype: int64

In [379]:
df['A'].unique()

array([ 1,  4,  7, 10])

### Loading data from Files

In [380]:
# Loading data from csv files
coffee = pd.read_csv("./data/coffee.csv")
bios = pd.read_csv('./data/bios.csv')

In [381]:
# Loading data from paraquet files
results = pd.read_parquet('./data/results.parquet')

In [382]:
# Loading data from excel files
excel = pd.read_excel("./data/olympics-data.xlsx")

### Accessing data

In [383]:
print(coffee)

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [384]:
display(coffee)

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [385]:
coffee.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

In [386]:
coffee.tail(7)

         Day Coffee Type  Units Sold
7   Thursday       Latte          30
8     Friday    Espresso          45
9     Friday       Latte          35
10  Saturday    Espresso          45
11  Saturday       Latte          35
12    Sunday    Espresso          45
13    Sunday       Latte          35

In [387]:
coffee.sample(5,random_state=1) # Pass in random_state to make deterministic

         Day Coffee Type  Units Sold
3    Tuesday       Latte          20
7   Thursday       Latte          30
6   Thursday    Espresso          40
2    Tuesday    Espresso          30
10  Saturday    Espresso          45

In [388]:
# loc
# coffee.loc[Rows, Columns]
coffee.loc[1:3,["Day","Units Sold"]]

       Day  Units Sold
1   Monday          15
2  Tuesday          30
3  Tuesday          20

In [389]:
coffee.iloc[2:4,[0,2]]

       Day  Units Sold
2  Tuesday          30
3  Tuesday          20

In [390]:
# Some fancy stuff
coffee.index=coffee.Day

In [391]:
coffee.loc["Monday":"Wednesday"]

                 Day Coffee Type  Units Sold
Day
Monday        Monday    Espresso          25
Monday        Monday       Latte          15
Tuesday      Tuesday    Espresso          30
Tuesday      Tuesday       Latte          20
Wednesday  Wednesday    Espresso          35
Wednesday  Wednesday       Latte          25

In [392]:
coffee = pd.read_csv('./data/coffee.csv')

In [393]:
# Setting values
coffee.loc[1:3,["Units Sold"]]=10
coffee.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          10
2    Tuesday    Espresso          10
3    Tuesday       Latte          10
4  Wednesday    Espresso          35

In [394]:
# get single values (.at & .iat)
coffee.at[1,"Units Sold"]

np.int64(10)

In [395]:
coffee.iat[1,1]

'Latte'

In [396]:
# sort values
coffee.sort_values(["Units Sold"], ascending=False)

          Day Coffee Type  Units Sold
10   Saturday    Espresso          45
8      Friday    Espresso          45
12     Sunday    Espresso          45
6    Thursday    Espresso          40
4   Wednesday    Espresso          35
11   Saturday       Latte          35
13     Sunday       Latte          35
9      Friday       Latte          35
7    Thursday       Latte          30
0      Monday    Espresso          25
5   Wednesday       Latte          25
2     Tuesday    Espresso          10
1      Monday       Latte          10
3     Tuesday       Latte          10

In [397]:
coffee.sort_values(["Units Sold", "Coffee Type"], ascending=[1,0])

          Day Coffee Type  Units Sold
1      Monday       Latte          10
3     Tuesday       Latte          10
2     Tuesday    Espresso          10
5   Wednesday       Latte          25
0      Monday    Espresso          25
7    Thursday       Latte          30
9      Friday       Latte          35
11   Saturday       Latte          35
13     Sunday       Latte          35
4   Wednesday    Espresso          35
6    Thursday    Espresso          40
8      Friday    Espresso          45
10   Saturday    Espresso          45
12     Sunday    Espresso          45

In [398]:
# Iterate over dataframe using for loop
for index,row in coffee.iterrows():
    print(index)
    print(row,"\n\n\n")

0
Day              Monday
Coffee Type    Espresso
Units Sold           25
Name: 0, dtype: object



1
Day            Monday
Coffee Type     Latte
Units Sold         10
Name: 1, dtype: object



2
Day             Tuesday
Coffee Type    Espresso
Units Sold           10
Name: 2, dtype: object



3
Day            Tuesday
Coffee Type      Latte
Units Sold          10
Name: 3, dtype: object



4
Day            Wednesday
Coffee Type     Espresso
Units Sold            35
Name: 4, dtype: object



5
Day            Wednesday
Coffee Type        Latte
Units Sold            25
Name: 5, dtype: object



6
Day            Thursday
Coffee Type    Espresso
Units Sold           40
Name: 6, dtype: object



7
Day            Thursday
Coffee Type       Latte
Units Sold           30
Name: 7, dtype: object



8
Day              Friday
Coffee Type    Espresso
Units Sold           45
Name: 8, dtype: object



9
Day            Friday
Coffee Type     Latte
Units Sold         35
Name: 9, dtype: object



10
Day            Saturday
Coffee Type    Espresso
Units Sold           45
Name: 10, dtype: object



11
Day            Saturday
Coffee Type       Latte
Units Sold           35
Name: 11, dtype: object



12
Day              Sunday
Coffee Type    Espresso
Units Sold           45
Name: 12, dtype: object



13
Day            Sunday
Coffee Type     Latte
Units Sold         35
Name: 13, dtype: object

### Filtering data

In [399]:
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25

In [400]:
bios.loc[bios["height_cm"]>215]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
5089,5108,Viktor Pankrashkin,1957-06-19,Moskva (Moscow),Moskva,RUS,Soviet Union,220.0,112.0,1993-07-24
5583,5606,Paulinho Villas Boas,1963-01-26,São Paulo,São Paulo,BRA,Brazil,217.0,106.0,NaN
5673,5696,Gunther Behnke,1963-01-19,Leverkusen,Nordrhein-Westfalen,GER,Germany,221.0,114.0,NaN
5716,5739,Uwe Blab,1962-03-26,München (Munich),Bayern,GER,Germany West Germany,218.0,110.0,NaN
5781,5804,Tommy Burleson,1952-02-24,Crossnore,North Carolina,USA,United States,223.0,102.0,NaN
5796,5819,Andy Campbell,1956-07-21,Melbourne,Victoria,AUS,Australia,218.0,93.0,NaN
6223,6250,Lars Hansen,1954-09-27,København (Copenhagen),Hovedstaden,DEN,Canada,216.0,105.0,NaN
6270,6298,Hu Zhangbao,1963-04-05,NaN,NaN,NaN,People's Republic of China,216.0,135.0,NaN
6409,6440,Sergey Kovalenko,1947-08-11,NaN,NaN,NaN,Soviet Union,216.0,111.0,2004-11-18
6420,6451,Jānis Krūmiņš,1930-01-30,Cēsis,Cēsu novads,LAT,Soviet Union,218.0,141.0,1994-11-20
6504,6537,Luc Longley,1969-01-19,Melbourne,Victoria,AUS,Australia,220.0,135.0,NaN
6722,6755,Shaquille O'Neal,1972-03-06,Newark,New Jersey,USA,United States,216.0,137.0,NaN
6937,6972,David Robinson,1965-08-06,Key West,Florida,USA,United States,216.0,107.0,NaN
6978,7013,Arvydas Sabonis,1964-12-19,Kaunas,Kaunas,LTU,Lithuania Soviet Union,223.0,122.0,NaN
7074,7111,Paulo da Silva,1963-07-21,São Paulo,São Paulo,BRA,Brazil,217.0,106.0,NaN
7188,7226,Vladimir Tkachenko,1957-09-20,Golovinka,Krasnodar Kray,RUS,Soviet Union,220.0,110.0,NaN
7281,7320,Stojko Vranković,1964-01-22,Drniš,Šibensko-kninska županija,CRO,Croatia Yugoslavia,217.0,115.0,NaN
7376,7416,Eurelijus Žukauskas,1973-08-22,Klaipėda,Klaipėda,LTU,Lithuania,218.0,115.0,NaN
52608,52983,Aleksey Kazakov,1976-03-18,Naberezhnye Chelny,Respublika Tatarstan,RUS,Russian Federation,217.0,102.0,NaN
82100,82753,Frédéric Weis,1977-06-22,Thionville,Moselle,FRA,France,218.0,110.0,NaN
89070,89782,Yao Ming,1980-09-12,Xuhui District,Shanghai,CHN,People's Republic of China,226.0,141.0,NaN
89075,89787,Roberto Dueñas,1975-11-01,Madrid,Madrid,ESP,Spain,221.0,137.0,NaN
107408,108533,Peter John Ramos,1985-05-23,Fajardo,Puerto Rico,PUR,Puerto Rico,219.0,113.0,NaN
112312,113568,Stanko Barać,1986-08-13,Mostar,Hercegovačko-neretvanski kanton,BIH,Croatia,217.0,110.0,NaN
112332,113588,Andreas Glyniadakis,1981-08-26,Chania,Kriti,GRE,Greece,216.0,115.0,NaN
112337,113593,Hamed Haddadi,1985-05-19,Ahvaz,Khuzestan,IRI,Islamic Republic of Iran,218.0,110.0,NaN
118663,120400,Timofey Mozgov,1986-07-16,NaN,NaN,NaN,Russian Federation,216.0,113.0,NaN
118676,120415,Dmitry Musersky,1988-10-29,Makiïvka,Donetsk,UKR,Russian Federation,219.0,104.0,NaN
120266,122147,Zhang Zhaoxu,1987-11-18,Binzhou,Shandong,CHN,People's Republic of China,221.0,110.0,NaN
121694,123709,Salah Mejri,1986-06-15,Jendouba,Jendouba,TUN,Tunisia,216.0,110.0,NaN
123850,126093,Tyson Chandler,1982-10-02,Hanford,California,USA,United States,216.0,107.0,NaN
130460,133147,Li Muhao,1992-06-02,Guiyang,Guizhou,CHN,People's Republic of China,218.0,115.0,NaN
130461,133148,Zhou Qi,1996-01-16,Xinxiang,Henan,CHN,People's Republic of China,217.0,95.0,NaN
138671,142084,Ondřej Balvín,1992-09-20,Ústí nad Labem,Ústecký kraj,CZE,Czechia,216.0,107.0,NaN
139365,142836,Moustapha Fall,1992-02-23,Paris,Paris,FRA,France,218.0,NaN,NaN

In [401]:
bios.loc[bios["height_cm"]>220,["name","height_cm"]]

                   name  height_cm
5673     Gunther Behnke      221.0
5781     Tommy Burleson      223.0
6978    Arvydas Sabonis      223.0
89070          Yao Ming      226.0
89075    Roberto Dueñas      221.0
120266     Zhang Zhaoxu      221.0

In [402]:
# Short-hand syntax (without .loc)
bios[bios["height_cm"]>220][["name","height_cm"]]

                   name  height_cm
5673     Gunther Behnke      221.0
5781     Tommy Burleson      223.0
6978    Arvydas Sabonis      223.0
89070          Yao Ming      226.0
89075    Roberto Dueñas      221.0
120266     Zhang Zhaoxu      221.0

In [403]:
# Multiple filter conditions
bios[(bios["height_cm"]>150) & (bios["born_country"]=="IND") & (bios["born_region"]=="Andhra Pradesh")]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
19014,19147,Joe Antic,1931-03-13,Secunderabad,Andhra Pradesh,IND,India,168.0,59.0,2016-07-12
19085,19219,Mukesh Kumar Nandanoori,1970-04-16,Hyderabad,Andhra Pradesh,IND,India,175.0,64.0,NaN
25607,25799,Tulasidas Balaram,1936-11-30,Secunderabad,Andhra Pradesh,IND,India,171.0,56.0,2023-02-16
25617,25809,Dharmalingam Kannan,1936-07-08,Secunderabad,Andhra Pradesh,IND,India,163.0,54.0,2006-05-19
25620,25812,Youssef Khan,1937-08-05,Hyderabad,Andhra Pradesh,IND,India,172.0,56.0,2006-07-01
25642,25834,Peter Thangaraj,1935-12-24,Hyderabad,Andhra Pradesh,IND,India,190.0,85.0,2008-11-24
46816,47165,Sheila Watt,1941-01-27,Pitapuram,Andhra Pradesh,IND,Great Britain,164.0,64.0,2023-03-10
60816,61255,Ahmed Abdul Basith,1942-01-09,Hyderabad,Andhra Pradesh,IND,India,178.0,75.0,2021-01-01
106400,107497,Sharath Kamal Achanta,1982-07-12,Machilipatnam,Andhra Pradesh,IND,India,186.0,85.0,NaN
107178,108301,Sathi Geetha,1983-07-05,Martur,Andhra Pradesh,IND,India,156.0,52.0,NaN
110298,111512,Pranitha Vardhineni,1990-11-17,Kalleda,Andhra Pradesh,IND,India,155.0,67.0,NaN
116228,117613,Sania Mirza,1986-11-15,Hyderabad,Andhra Pradesh,IND,India,173.0,57.0,NaN
118538,120264,Rushmi Chakravarthi,1977-10-09,Hyderabad,Andhra Pradesh,IND,India,170.0,65.0,NaN
121855,123878,Jagadeesan Vishnuvardhan,1987-07-27,Secunderabad,Andhra Pradesh,IND,India,188.0,84.0,NaN
123480,125680,Parupalli Kashyap,1986-09-08,Hyderabad,Andhra Pradesh,IND,India,173.0,NaN,NaN
128046,130550,P. V. Sindhu,1995-07-05,Hyderabad,Andhra Pradesh,IND,India,179.0,65.0,NaN
131620,134434,B. Sumeeth Reddy,1991-09-26,Gungal,Andhra Pradesh,IND,India,182.0,64.0,NaN
131621,134435,Srikanth Kidambi,1993-02-07,Guntur,Andhra Pradesh,IND,India,178.0,66.0,NaN
131636,134452,Kynan Chenai,1991-01-29,Hyderabad,Andhra Pradesh,IND,India,200.0,85.0,NaN

In [404]:
# Filter by string conditions
bios[bios["name"].str.contains("Sindhu",case=False)]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
19492,19631,Tara Singh Sindhu,1943-07-19,NaN,NaN,NaN,Malaysia,NaN,NaN,NaN
128046,130550,P. V. Sindhu,1995-07-05,Hyderabad,Andhra Pradesh,IND,India,179.0,65.0,NaN

In [405]:
# Regex syntax
bios[bios['name'].str.contains('Sindhu|Sumeeth ', case=False)]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
19492,19631,Tara Singh Sindhu,1943-07-19,NaN,NaN,NaN,Malaysia,NaN,NaN,NaN
128046,130550,P. V. Sindhu,1995-07-05,Hyderabad,Andhra Pradesh,IND,India,179.0,65.0,NaN
131620,134434,B. Sumeeth Reddy,1991-09-26,Gungal,Andhra Pradesh,IND,India,182.0,64.0,NaN

In [406]:
## isin method & startswith
bios[bios['born_country'].isin(["USA", "FRA"]) & (bios['name'].str.startswith("Joe"))]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
2741,2753,Joe Cunningham,1867-02-26,Aberdeen,Mississippi,USA,United States,NaN,NaN,1951-07-27
5791,5814,Joe Caldwell,1941-11-01,Texas City,Texas,USA,United States,196.0,89.0,NaN
6101,6128,Joe Fortenberry,1911-04-01,Slidell,Texas,USA,United States,203.0,84.0,1993-06-03
6379,6410,Joe Kleine,1962-01-04,Colorado Springs,Colorado,USA,United States,211.0,122.0,NaN
8624,8671,Joe Frazier,1944-01-12,Beaufort,South Carolina,USA,United States,183.0,89.0,2011-11-07
...,...,...,...,...,...,...,...,...,...,...
133440,136379,Joe Maloy,1985-12-20,Somers Point,New Jersey,USA,United States,175.0,65.0,NaN
135381,138595,Joey Steggall,2003-07-17,Annecy,Haute-Savoie,FRA,Australia,NaN,NaN,NaN
143679,147333,Joe Klecker,1996-11-16,Minneapolis,Minnesota,USA,United States,183.0,NaN,NaN
143731,147386,Joe Speer Ryan,1996-06-05,San Francisco,California,USA,United States,188.0,NaN,NaN
143775,147431,Joe Schroeder,1993-06-14,Indianapolis,Indiana,USA,United States,196.0,108.0,NaN

##### Query functions

In [407]:
bios.query('born_country=="IND" and born_city=="Hyderabad"')

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
281,282,S. M. Hadi,1899-08-12,Hyderabad,Andhra Pradesh,IND,India,NaN,NaN,1971-07-14
19085,19219,Mukesh Kumar Nandanoori,1970-04-16,Hyderabad,Andhra Pradesh,IND,India,175.0,64.0,NaN
25620,25812,Youssef Khan,1937-08-05,Hyderabad,Andhra Pradesh,IND,India,172.0,56.0,2006-07-01
25642,25834,Peter Thangaraj,1935-12-24,Hyderabad,Andhra Pradesh,IND,India,190.0,85.0,2008-11-24
60816,61255,Ahmed Abdul Basith,1942-01-09,Hyderabad,Andhra Pradesh,IND,India,178.0,75.0,2021-01-01
116228,117613,Sania Mirza,1986-11-15,Hyderabad,Andhra Pradesh,IND,India,173.0,57.0,NaN
118538,120264,Rushmi Chakravarthi,1977-10-09,Hyderabad,Andhra Pradesh,IND,India,170.0,65.0,NaN
123480,125680,Parupalli Kashyap,1986-09-08,Hyderabad,Andhra Pradesh,IND,India,173.0,NaN,NaN
128046,130550,P. V. Sindhu,1995-07-05,Hyderabad,Andhra Pradesh,IND,India,179.0,65.0,NaN
131636,134452,Kynan Chenai,1991-01-29,Hyderabad,Andhra Pradesh,IND,India,200.0,85.0,NaN

### Adding/Removing data

In [408]:
coffee.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          10
2    Tuesday    Espresso          10
3    Tuesday       Latte          10
4  Wednesday    Espresso          35

In [409]:
coffee['Price'] = 10

In [410]:
coffee.head()

         Day Coffee Type  Units Sold  Price
0     Monday    Espresso          25     10
1     Monday       Latte          10     10
2    Tuesday    Espresso          10     10
3    Tuesday       Latte          10     10
4  Wednesday    Espresso          35     10

In [411]:
coffee["New Price"] = np.where(coffee["Coffee Type"]=="Latte",15,10)
coffee.sample(5,random_state=1)

         Day Coffee Type  Units Sold  Price  New Price
3    Tuesday       Latte          10     10         15
7   Thursday       Latte          30     10         15
6   Thursday    Espresso          40     10         10
2    Tuesday    Espresso          10     10         10
10  Saturday    Espresso          45     10         10

In [412]:
coffee.drop(columns=["Price"],inplace=True)
# the below would also have worked
# coffee = coffee.drop(columns=['price'])
coffee.head()

         Day Coffee Type  Units Sold  New Price
0     Monday    Espresso          25         10
1     Monday       Latte          10         15
2    Tuesday    Espresso          10         10
3    Tuesday       Latte          10         15
4  Wednesday    Espresso          35         10

In [413]:
coffee = coffee[['Day', 'Coffee Type', 'Units Sold', 'New Price']]
coffee.tail()

         Day Coffee Type  Units Sold  New Price
9     Friday       Latte          35         15
10  Saturday    Espresso          45         10
11  Saturday       Latte          35         15
12    Sunday    Espresso          45         10
13    Sunday       Latte          35         15

In [414]:
coffee['revenue'] = coffee['Units Sold'] * coffee['New Price']
coffee.head()

         Day Coffee Type  Units Sold  New Price  revenue
0     Monday    Espresso          25         10      250
1     Monday       Latte          10         15      150
2    Tuesday    Espresso          10         10      100
3    Tuesday       Latte          10         15      150
4  Wednesday    Espresso          35         10      350

In [415]:
coffee.rename(columns={'New Price': 'price'}, inplace=True)
coffee.head()

         Day Coffee Type  Units Sold  price  revenue
0     Monday    Espresso          25     10      250
1     Monday       Latte          10     15      150
2    Tuesday    Espresso          10     10      100
3    Tuesday       Latte          10     15      150
4  Wednesday    Espresso          35     10      350

In [416]:
bios_new = bios.copy()

In [417]:
bios_new['first_name'] = bios_new['name'].str.split(' ').str[0]

In [418]:
bios_new.query('first_name == "Keith"')

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,first_name
1897,1907,Keith Hanlon,1966-09-01,NaN,NaN,NaN,Ireland,NaN,NaN,NaN,Keith
3505,3517,Keith Wallace,1961-03-29,Preston,England,GBR,Great Britain,165.0,51.0,1999-12-31,Keith
6228,6255,Keith Hartley,1940-10-15,Vancouver,British Columbia,CAN,Canada,200.0,85.0,NaN,Keith
8898,8946,Keith Mwila,1966-01-01,NaN,NaN,NaN,Zambia,NaN,NaN,1993-01-09,Keith
12053,12118,Keith Hervey,1898-11-03,Fulham,England,GBR,Great Britain,NaN,NaN,1973-02-22,Keith
...,...,...,...,...,...,...,...,...,...,...,...
99921,100722,Keith Carney,1970-02-03,Providence,Rhode Island,USA,United States,188.0,93.0,NaN,Keith
102227,103168,Keith Beavers,1983-02-09,London,Ontario,CAN,Canada,185.0,75.0,NaN,Keith
109900,111105,Keith Cumberpatch,1927-08-25,Christchurch,Canterbury,NZL,New Zealand,NaN,NaN,2013-11-15,Keith
115973,117348,Keith Sanderson,1975-02-02,Plymouth,Massachusetts,USA,United States,183.0,95.0,NaN,Keith
122121,124176,Keith Ferguson,1979-09-07,Sale,Victoria,AUS,Australia,176.0,78.0,NaN,Keith

In [419]:
bios_new['born_datetime'] = pd.to_datetime(bios_new['born_date'])
bios_new['born_year'] = bios_new['born_datetime'].dt.year
bios_new[['name','born_year']]

                         name  born_year
0       Jean-François Blanchy     1886.0
1              Arnaud Boetsch     1969.0
2                Jean Borotra     1898.0
3             Jacques Brugnon     1895.0
4                Albert Canet     1878.0
...                       ...        ...
145495      Polina Luchnikova     2002.0
145496    Valeriya Merkusheva     1999.0
145497        Yuliya Smirnova     1998.0
145498         André Foussard     1899.0
145499          Bill Phillips     1913.0

[145500 rows x 2 columns]

In [420]:
bios_new.to_csv('./data/bios_new.csv', index=False)

In [421]:
bios['height_category'] = bios['height_cm'].apply(lambda x: 'Short' if x < 165 else ('Average' if x < 185 else 'Tall'))

In [422]:
def categorize_athlete(row):
    if row['height_cm'] < 175 and row['weight_kg'] < 70:
        return 'Lightweight'
    elif row['height_cm'] < 185 or row['weight_kg'] <= 80:
        return 'Middleweight'
    
    else:
        return 'Heavyweight'
    
bios['Category'] = bios.apply(categorize_athlete, axis=1)

In [423]:
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,height_category,Category
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Tall,Heavyweight
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Average,Middleweight
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Average,Middleweight
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Average,Lightweight
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Tall,Heavyweight

### Merging & Concatenating Data

In [424]:
nocs = pd.read_csv('./data/noc_regions.csv')
nocs.head()

   NOC       region                 notes
0  AFG  Afghanistan                   NaN
1  AHO      Curacao  Netherlands Antilles
2  ALB      Albania                   NaN
3  ALG      Algeria                   NaN
4  AND      Andorra                   NaN

In [425]:
bios_new = pd.merge(bios, nocs, left_on='born_country', right_on='NOC', how='left')
bios_new.rename(columns={'region': 'born_country_full'}, inplace=True)
bios_new.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC_x,height_cm,weight_kg,died_date,height_category,Category,NOC_y,born_country_full,notes
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Tall,Heavyweight,FRA,France,NaN
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Average,Middleweight,FRA,France,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Average,Middleweight,FRA,France,NaN
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Average,Lightweight,FRA,France,NaN
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Tall,Heavyweight,GBR,UK,NaN

In [426]:
usa = bios[bios['born_country']=='USA'].copy()
gbr = bios[bios['born_country']=='GBR'].copy()
new_df = pd.concat([usa,gbr])

In [427]:
new_df.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,height_category,Category
54,55,Monique Javer,1967-07-22,Burlingame,California,USA,Great Britain,177.0,64.0,NaN,Average,Middleweight
960,964,Xóchitl Escobedo,1968-09-17,West Covina,California,USA,Mexico,170.0,60.0,NaN,Average,Lightweight
961,965,Angélica Gavaldón,1973-10-03,El Centro,California,USA,Mexico,160.0,54.0,NaN,Short,Lightweight
1231,1238,Bert Schneider,1897-07-01,Cleveland,Ohio,USA,Canada,NaN,NaN,1986-02-20,Tall,Heavyweight
1345,1352,Laura Berg,1975-01-06,Santa Fe Springs,California,USA,United States,168.0,61.0,NaN,Average,Lightweight

In [428]:
combined_df = pd.merge(results, bios, on='athlete_id', how='left')
combined_df.sample(3,random_state=4)

,year,type,discipline,event,as,athlete_id,noc,team,place,tied,...,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,height_category,Category
117096,1968.0,Summer,Volleyball (Volleyball),"Volleyball, Men (Olympic)",Wojciech Rutkowski,52897,POL,Poland,5.0,False,...,1935-11-19,Warszawa (Warsaw),Mazowieckie,POL,Poland,190.0,83.0,1994-05-29,Tall,Heavyweight
68122,1960.0,Summer,Artistic Gymnastics (Gymnastics),"Floor Exercise, Men (Olympic)",Hermenegildo Candeias,30898,POR,None,111.0,True,...,1934-04-17,Oeiras,Distrito de Lisboa,POR,Portugal,162.0,55.0,2023-01-10,Short,Lightweight
78620,1952.0,Summer,Modern Pentathlon,"Individual, Men (Olympic)",Lem Martínez,35132,URU,None,43.0,False,...,1923-06-01,Riachuelo,Colonia,URU,Uruguay,NaN,NaN,NaN,Tall,Heavyweight

### Handling Null Values

In [429]:
coffee.loc[[2,3], 'Units Sold'] = np.nan
coffee.head()

         Day Coffee Type  Units Sold  price  revenue
0     Monday    Espresso        25.0     10      250
1     Monday       Latte        10.0     15      150
2    Tuesday    Espresso         NaN     10      100
3    Tuesday       Latte         NaN     15      150
4  Wednesday    Espresso        35.0     10      350

In [430]:
coffee['Units Sold'].fillna(coffee['Units Sold'].mean())

0     25.00
1     10.00
2     33.75
3     33.75
4     35.00
5     25.00
6     40.00
7     30.00
8     45.00
9     35.00
10    45.00
11    35.00
12    45.00
13    35.00
Name: Units Sold, dtype: float64

In [431]:
coffee['Units Sold'].interpolate()

0     25.000000
1     10.000000
2     18.333333
3     26.666667
4     35.000000
5     25.000000
6     40.000000
7     30.000000
8     45.000000
9     35.000000
10    45.000000
11    35.000000
12    45.000000
13    35.000000
Name: Units Sold, dtype: float64

In [432]:
coffee.dropna(subset=['Units Sold']) # Use inplace=True if you want to update the coffee df

          Day Coffee Type  Units Sold  price  revenue
0      Monday    Espresso        25.0     10      250
1      Monday       Latte        10.0     15      150
4   Wednesday    Espresso        35.0     10      350
5   Wednesday       Latte        25.0     15      375
6    Thursday    Espresso        40.0     10      400
7    Thursday       Latte        30.0     15      450
8      Friday    Espresso        45.0     10      450
9      Friday       Latte        35.0     15      525
10   Saturday    Espresso        45.0     10      450
11   Saturday       Latte        35.0     15      525
12     Sunday    Espresso        45.0     10      450
13     Sunday       Latte        35.0     15      525

In [433]:
coffee[coffee['Units Sold'].notna()]

          Day Coffee Type  Units Sold  price  revenue
0      Monday    Espresso        25.0     10      250
1      Monday       Latte        10.0     15      150
4   Wednesday    Espresso        35.0     10      350
5   Wednesday       Latte        25.0     15      375
6    Thursday    Espresso        40.0     10      400
7    Thursday       Latte        30.0     15      450
8      Friday    Espresso        45.0     10      450
9      Friday       Latte        35.0     15      525
10   Saturday    Espresso        45.0     10      450
11   Saturday       Latte        35.0     15      525
12     Sunday    Espresso        45.0     10      450
13     Sunday       Latte        35.0     15      525

In [434]:
coffee

          Day Coffee Type  Units Sold  price  revenue
0      Monday    Espresso        25.0     10      250
1      Monday       Latte        10.0     15      150
2     Tuesday    Espresso         NaN     10      100
3     Tuesday       Latte         NaN     15      150
4   Wednesday    Espresso        35.0     10      350
5   Wednesday       Latte        25.0     15      375
6    Thursday    Espresso        40.0     10      400
7    Thursday       Latte        30.0     15      450
8      Friday    Espresso        45.0     10      450
9      Friday       Latte        35.0     15      525
10   Saturday    Espresso        45.0     10      450
11   Saturday       Latte        35.0     15      525
12     Sunday    Espresso        45.0     10      450
13     Sunday       Latte        35.0     15      525

### Aggregating Data

In [435]:
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,height_category,Category
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Tall,Heavyweight
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Average,Middleweight
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Average,Middleweight
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Average,Lightweight
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Tall,Heavyweight

In [436]:
bios['born_city'].value_counts()

born_city
Budapest           1378
Moskva (Moscow)     883
Oslo                708
Stockholm           629
Praha (Prague)      600
                   ...
Kirovgrad             1
Pereiaslav            1
Podgornyy             1
Kudepsta              1
Furmanov              1
Name: count, Length: 22368, dtype: int64

In [437]:
bios[bios['born_country']=='USA']['born_region'].value_counts().head(10)

born_region
California       1634
New York          990
Illinois          585
Massachusetts     530
Pennsylvania      530
New Jersey        381
Texas             368
Minnesota         365
Ohio              328
Michigan          319
Name: count, dtype: int64

In [438]:
bios[bios['born_country']=='USA']['born_region'].value_counts().tail(10)

born_region
Alaska           45
Arkansas         42
Idaho            41
New Mexico       38
Nevada           36
South Dakota     27
West Virginia    24
Delaware         22
North Dakota     16
Wyoming          14
Name: count, dtype: int64

### Groupby function in Pandas

In [439]:
coffee.groupby(["Coffee Type"])["Units Sold"].sum()

Coffee Type
Espresso    235.0
Latte       170.0
Name: Units Sold, dtype: float64

In [440]:
coffee.groupby(["Day"])["Units Sold"].mean()

Day
Friday       40.0
Monday       17.5
Saturday     40.0
Sunday       40.0
Thursday     35.0
Tuesday       NaN
Wednesday    30.0
Name: Units Sold, dtype: float64

In [441]:
coffee.groupby(["Coffee Type","Day"]).agg({"Units Sold": "sum","price":"mean"})

                       Units Sold  price
Coffee Type Day
Espresso    Friday           45.0   10.0
            Monday           25.0   10.0
            Saturday         45.0   10.0
            Sunday           45.0   10.0
            Thursday         40.0   10.0
            Tuesday           0.0   10.0
            Wednesday        35.0   10.0
Latte       Friday           35.0   15.0
            Monday           10.0   15.0
            Saturday         35.0   15.0
            Sunday           35.0   15.0
            Thursday         30.0   15.0
            Tuesday           0.0   15.0
            Wednesday        25.0   15.0

In [442]:
coffee.head()

         Day Coffee Type  Units Sold  price  revenue
0     Monday    Espresso        25.0     10      250
1     Monday       Latte        10.0     15      150
2    Tuesday    Espresso         NaN     10      100
3    Tuesday       Latte         NaN     15      150
4  Wednesday    Espresso        35.0     10      350